layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 416
    }
  }
}
layer {
  name: "Conv_0"
  type: "Convolution"
  bottom: "input"
  top: "1074"
  convolution_param {
    num_output: 24
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Clip_1"
  type: "ReLU"
  bottom: "1074"
  top: "536"
}
layer {
  name: "MaxPool_2"
  type: "Pooling"
  bottom: "536"
  top: "537"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "Conv_3"
  type: "Convolution"
  bottom: "537"
  top: "1077"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_4"
  type: "ReLU"
  bottom: "1077"
  top: "542"
}
layer {
  name: "Conv_5"
  type: "Convolution"
  bottom: "542"
  top: "1080"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 48
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Conv_6"
  type: "Convolution"
  bottom: "1080"
  top: "1083"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_7"
  type: "ReLU"
  bottom: "1083"
  top: "549"
}
layer {
  name: "Conv_8"
  type: "Convolution"
  bottom: "537"
  top: "1086"
  convolution_param {
    num_output: 24
    bias_term: true
    group: 24
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Conv_9"
  type: "Convolution"
  bottom: "1086"
  top: "1089"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_10"
  type: "ReLU"
  bottom: "1089"
  top: "556"
}
layer {
  name: "Concat_11"
  type: "Concat"
  bottom: "549"
  bottom: "556"
  top: "557"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_12"
  type: "Convolution"
  bottom: "557"
  top: "1092"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_13"
  type: "ReLU"
  bottom: "1092"
  top: "562"
}
layer {
  name: "Conv_14"
  type: "Convolution"
  bottom: "562"
  top: "1095"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_15"
  type: "ReLU"
  bottom: "1095"
  top: "567"
}
layer {
  name: "UnifiedSlice_16"
  type: "Slice"
  bottom: "567"
  top: "572"
  top: "577"
  slice_param {
    slice_point: 48
    axis: 1
  }
}
layer {
  name: "Conv_17"
  type: "Convolution"
  bottom: "572"
  top: "1098"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_18"
  type: "ReLU"
  bottom: "1098"
  top: "582"
}
layer {
  name: "Conv_19"
  type: "Convolution"
  bottom: "582"
  top: "1101"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 48
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_20"
  type: "Concat"
  bottom: "1101"
  bottom: "582"
  top: "585"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_21"
  type: "Convolution"
  bottom: "585"
  top: "1104"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_22"
  type: "ReLU"
  bottom: "1104"
  top: "590"
}
layer {
  name: "Concat_23"
  type: "Concat"
  bottom: "590"
  bottom: "577"
  top: "591"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_24"
  type: "ReLU"
  bottom: "591"
  top: "593"
}
layer {
  name: "UnifiedSlice_25"
  type: "Slice"
  bottom: "593"
  top: "598"
  top: "603"
  slice_param {
    slice_point: 48
    axis: 1
  }
}
layer {
  name: "Conv_26"
  type: "Convolution"
  bottom: "598"
  top: "1107"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_27"
  type: "ReLU"
  bottom: "1107"
  top: "608"
}
layer {
  name: "Conv_28"
  type: "Convolution"
  bottom: "608"
  top: "1110"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 48
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_29"
  type: "Concat"
  bottom: "1110"
  bottom: "608"
  top: "611"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_30"
  type: "Convolution"
  bottom: "611"
  top: "1113"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_31"
  type: "ReLU"
  bottom: "1113"
  top: "616"
}
layer {
  name: "Concat_32"
  type: "Concat"
  bottom: "616"
  bottom: "603"
  top: "617"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_33"
  type: "ReLU"
  bottom: "617"
  top: "input.75"
}
layer {
  name: "Conv_34"
  type: "Convolution"
  bottom: "input.75"
  top: "1116"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_35"
  type: "ReLU"
  bottom: "1116"
  top: "624"
}
layer {
  name: "Conv_36"
  type: "Convolution"
  bottom: "624"
  top: "1119"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Conv_37"
  type: "Convolution"
  bottom: "1119"
  top: "1122"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_38"
  type: "ReLU"
  bottom: "1122"
  top: "631"
}
layer {
  name: "Conv_39"
  type: "Convolution"
  bottom: "input.75"
  top: "1125"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Conv_40"
  type: "Convolution"
  bottom: "1125"
  top: "1128"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_41"
  type: "ReLU"
  bottom: "1128"
  top: "638"
}
layer {
  name: "Concat_42"
  type: "Concat"
  bottom: "631"
  bottom: "638"
  top: "639"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_43"
  type: "Convolution"
  bottom: "639"
  top: "1131"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 192
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_44"
  type: "ReLU"
  bottom: "1131"
  top: "644"
}
layer {
  name: "Conv_45"
  type: "Convolution"
  bottom: "644"
  top: "1134"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_46"
  type: "ReLU"
  bottom: "1134"
  top: "649"
}
layer {
  name: "UnifiedSlice_47"
  type: "Slice"
  bottom: "649"
  top: "654"
  top: "659"
  slice_param {
    slice_point: 96
    axis: 1
  }
}
layer {
  name: "Conv_48"
  type: "Convolution"
  bottom: "654"
  top: "1137"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_49"
  type: "ReLU"
  bottom: "1137"
  top: "664"
}
layer {
  name: "Conv_50"
  type: "Convolution"
  bottom: "664"
  top: "1140"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_51"
  type: "Concat"
  bottom: "1140"
  bottom: "664"
  top: "667"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_52"
  type: "Convolution"
  bottom: "667"
  top: "1143"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_53"
  type: "ReLU"
  bottom: "1143"
  top: "672"
}
layer {
  name: "Concat_54"
  type: "Concat"
  bottom: "672"
  bottom: "659"
  top: "673"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_55"
  type: "ReLU"
  bottom: "673"
  top: "675"
}
layer {
  name: "UnifiedSlice_56"
  type: "Slice"
  bottom: "675"
  top: "680"
  top: "685"
  slice_param {
    slice_point: 96
    axis: 1
  }
}
layer {
  name: "Conv_57"
  type: "Convolution"
  bottom: "680"
  top: "1146"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_58"
  type: "ReLU"
  bottom: "1146"
  top: "690"
}
layer {
  name: "Conv_59"
  type: "Convolution"
  bottom: "690"
  top: "1149"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_60"
  type: "Concat"
  bottom: "1149"
  bottom: "690"
  top: "693"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_61"
  type: "Convolution"
  bottom: "693"
  top: "1152"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_62"
  type: "ReLU"
  bottom: "1152"
  top: "698"
}
layer {
  name: "Concat_63"
  type: "Concat"
  bottom: "698"
  bottom: "685"
  top: "699"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_64"
  type: "ReLU"
  bottom: "699"
  top: "701"
}
layer {
  name: "UnifiedSlice_65"
  type: "Slice"
  bottom: "701"
  top: "706"
  top: "711"
  slice_param {
    slice_point: 96
    axis: 1
  }
}
layer {
  name: "Conv_66"
  type: "Convolution"
  bottom: "706"
  top: "1155"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_67"
  type: "ReLU"
  bottom: "1155"
  top: "716"
}
layer {
  name: "Conv_68"
  type: "Convolution"
  bottom: "716"
  top: "1158"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_69"
  type: "Concat"
  bottom: "1158"
  bottom: "716"
  top: "719"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_70"
  type: "Convolution"
  bottom: "719"
  top: "1161"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_71"
  type: "ReLU"
  bottom: "1161"
  top: "724"
}
layer {
  name: "Concat_72"
  type: "Concat"
  bottom: "724"
  bottom: "711"
  top: "725"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_73"
  type: "ReLU"
  bottom: "725"
  top: "727"
}
layer {
  name: "UnifiedSlice_74"
  type: "Slice"
  bottom: "727"
  top: "732"
  top: "737"
  slice_param {
    slice_point: 96
    axis: 1
  }
}
layer {
  name: "Conv_75"
  type: "Convolution"
  bottom: "732"
  top: "1164"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_76"
  type: "ReLU"
  bottom: "1164"
  top: "742"
}
layer {
  name: "Conv_77"
  type: "Convolution"
  bottom: "742"
  top: "1167"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_78"
  type: "Concat"
  bottom: "1167"
  bottom: "742"
  top: "745"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_79"
  type: "Convolution"
  bottom: "745"
  top: "1170"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_80"
  type: "ReLU"
  bottom: "1170"
  top: "750"
}
layer {
  name: "Concat_81"
  type: "Concat"
  bottom: "750"
  bottom: "737"
  top: "751"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_82"
  type: "ReLU"
  bottom: "751"
  top: "753"
}
layer {
  name: "UnifiedSlice_83"
  type: "Slice"
  bottom: "753"
  top: "758"
  top: "763"
  slice_param {
    slice_point: 96
    axis: 1
  }
}
layer {
  name: "Conv_84"
  type: "Convolution"
  bottom: "758"
  top: "1173"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_85"
  type: "ReLU"
  bottom: "1173"
  top: "768"
}
layer {
  name: "Conv_86"
  type: "Convolution"
  bottom: "768"
  top: "1176"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_87"
  type: "Concat"
  bottom: "1176"
  bottom: "768"
  top: "771"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_88"
  type: "Convolution"
  bottom: "771"
  top: "1179"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_89"
  type: "ReLU"
  bottom: "1179"
  top: "776"
}
layer {
  name: "Concat_90"
  type: "Concat"
  bottom: "776"
  bottom: "763"
  top: "777"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_91"
  type: "ReLU"
  bottom: "777"
  top: "779"
}
layer {
  name: "UnifiedSlice_92"
  type: "Slice"
  bottom: "779"
  top: "784"
  top: "789"
  slice_param {
    slice_point: 96
    axis: 1
  }
}
layer {
  name: "Conv_93"
  type: "Convolution"
  bottom: "784"
  top: "1182"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_94"
  type: "ReLU"
  bottom: "1182"
  top: "794"
}
layer {
  name: "Conv_95"
  type: "Convolution"
  bottom: "794"
  top: "1185"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_96"
  type: "Concat"
  bottom: "1185"
  bottom: "794"
  top: "797"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_97"
  type: "Convolution"
  bottom: "797"
  top: "1188"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_98"
  type: "ReLU"
  bottom: "1188"
  top: "802"
}
layer {
  name: "Concat_99"
  type: "Concat"
  bottom: "802"
  bottom: "789"
  top: "803"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_100"
  type: "ReLU"
  bottom: "803"
  top: "input.207"
}
layer {
  name: "Conv_101"
  type: "Convolution"
  bottom: "input.207"
  top: "1191"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_102"
  type: "ReLU"
  bottom: "1191"
  top: "810"
}
layer {
  name: "Conv_103"
  type: "Convolution"
  bottom: "810"
  top: "1194"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 192
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Conv_104"
  type: "Convolution"
  bottom: "1194"
  top: "1197"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_105"
  type: "ReLU"
  bottom: "1197"
  top: "817"
}
layer {
  name: "Conv_106"
  type: "Convolution"
  bottom: "input.207"
  top: "1200"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 192
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Conv_107"
  type: "Convolution"
  bottom: "1200"
  top: "1203"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_108"
  type: "ReLU"
  bottom: "1203"
  top: "824"
}
layer {
  name: "Concat_109"
  type: "Concat"
  bottom: "817"
  bottom: "824"
  top: "825"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_110"
  type: "Convolution"
  bottom: "825"
  top: "1206"
  convolution_param {
    num_output: 384
    bias_term: true
    group: 384
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_111"
  type: "ReLU"
  bottom: "1206"
  top: "830"
}
layer {
  name: "Conv_112"
  type: "Convolution"
  bottom: "830"
  top: "1209"
  convolution_param {
    num_output: 384
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_113"
  type: "ReLU"
  bottom: "1209"
  top: "835"
}
layer {
  name: "UnifiedSlice_114"
  type: "Slice"
  bottom: "835"
  top: "840"
  top: "845"
  slice_param {
    slice_point: 192
    axis: 1
  }
}
layer {
  name: "Conv_115"
  type: "Convolution"
  bottom: "840"
  top: "1212"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_116"
  type: "ReLU"
  bottom: "1212"
  top: "850"
}
layer {
  name: "Conv_117"
  type: "Convolution"
  bottom: "850"
  top: "1215"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 192
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_118"
  type: "Concat"
  bottom: "1215"
  bottom: "850"
  top: "853"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_119"
  type: "Convolution"
  bottom: "853"
  top: "1218"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_120"
  type: "ReLU"
  bottom: "1218"
  top: "858"
}
layer {
  name: "Concat_121"
  type: "Concat"
  bottom: "858"
  bottom: "845"
  top: "859"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_122"
  type: "ReLU"
  bottom: "859"
  top: "861"
}
layer {
  name: "UnifiedSlice_123"
  type: "Slice"
  bottom: "861"
  top: "866"
  top: "871"
  slice_param {
    slice_point: 192
    axis: 1
  }
}
layer {
  name: "Conv_124"
  type: "Convolution"
  bottom: "866"
  top: "1221"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_125"
  type: "ReLU"
  bottom: "1221"
  top: "876"
}
layer {
  name: "Conv_126"
  type: "Convolution"
  bottom: "876"
  top: "1224"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 192
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_127"
  type: "Concat"
  bottom: "1224"
  bottom: "876"
  top: "879"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_128"
  type: "Convolution"
  bottom: "879"
  top: "1227"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_129"
  type: "ReLU"
  bottom: "1227"
  top: "884"
}
layer {
  name: "Concat_130"
  type: "Concat"
  bottom: "884"
  bottom: "871"
  top: "885"
  concat_param {
    axis: 1
  }
}
layer {
  name: "channel_shuffle_131"
  type: "ReLU"
  bottom: "885"
  top: "input.283"
}
layer {
  name: "Conv_132"
  type: "Convolution"
  bottom: "input.75"
  top: "1230"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_133"
  type: "ReLU"
  bottom: "1230"
  top: "892"
}
layer {
  name: "Conv_134"
  type: "Convolution"
  bottom: "input.207"
  top: "1233"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_135"
  type: "ReLU"
  bottom: "1233"
  top: "897"
}
layer {
  name: "Conv_136"
  type: "Convolution"
  bottom: "input.283"
  top: "1236"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_137"
  type: "ReLU"
  bottom: "1236"
  top: "902"
}
layer {
  name: "_Resize_138"
  type: "Deconvolution"
  bottom: "902"
  top: "907"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 96
    weight_filler {
      type: "bilinear"
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 4
    kernel_w: 4
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "Concat_139"
  type: "Concat"
  bottom: "907"
  bottom: "897"
  top: "908"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_140"
  type: "Convolution"
  bottom: "908"
  top: "1239"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_141"
  type: "ReLU"
  bottom: "1239"
  top: "913"
}
layer {
  name: "Conv_142"
  type: "Convolution"
  bottom: "913"
  top: "1242"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 48
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_143"
  type: "Concat"
  bottom: "1242"
  bottom: "913"
  top: "916"
  concat_param {
    axis: 1
  }
}
layer {
  name: "_Resize_144"
  type: "Deconvolution"
  bottom: "916"
  top: "921"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 96
    weight_filler {
      type: "bilinear"
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 4
    kernel_w: 4
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "Concat_145"
  type: "Concat"
  bottom: "921"
  bottom: "892"
  top: "922"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_146"
  type: "Convolution"
  bottom: "922"
  top: "1245"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_147"
  type: "ReLU"
  bottom: "1245"
  top: "927"
}
layer {
  name: "Conv_148"
  type: "Convolution"
  bottom: "927"
  top: "1248"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 48
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_149"
  type: "Concat"
  bottom: "1248"
  bottom: "927"
  top: "930"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_150"
  type: "Convolution"
  bottom: "930"
  top: "1251"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Clip_151"
  type: "ReLU"
  bottom: "1251"
  top: "935"
}
layer {
  name: "Conv_152"
  type: "Convolution"
  bottom: "935"
  top: "1254"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_153"
  type: "ReLU"
  bottom: "1254"
  top: "940"
}
layer {
  name: "Concat_154"
  type: "Concat"
  bottom: "940"
  bottom: "916"
  top: "941"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_155"
  type: "Convolution"
  bottom: "941"
  top: "1257"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_156"
  type: "ReLU"
  bottom: "1257"
  top: "946"
}
layer {
  name: "Conv_157"
  type: "Convolution"
  bottom: "946"
  top: "1260"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 48
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_158"
  type: "Concat"
  bottom: "1260"
  bottom: "946"
  top: "949"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_159"
  type: "Convolution"
  bottom: "902"
  top: "1263"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Clip_160"
  type: "ReLU"
  bottom: "1263"
  top: "954"
}
layer {
  name: "Conv_161"
  type: "Convolution"
  bottom: "954"
  top: "1266"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_162"
  type: "ReLU"
  bottom: "1266"
  top: "959"
}
layer {
  name: "Conv_163"
  type: "Convolution"
  bottom: "949"
  top: "1269"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Clip_164"
  type: "ReLU"
  bottom: "1269"
  top: "964"
}
layer {
  name: "Conv_165"
  type: "Convolution"
  bottom: "964"
  top: "1272"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_166"
  type: "ReLU"
  bottom: "1272"
  top: "969"
}
layer {
  name: "Concat_167"
  type: "Concat"
  bottom: "969"
  bottom: "902"
  top: "970"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_168"
  type: "Convolution"
  bottom: "970"
  top: "1275"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_169"
  type: "ReLU"
  bottom: "1275"
  top: "975"
}
layer {
  name: "Conv_170"
  type: "Convolution"
  bottom: "975"
  top: "1278"
  convolution_param {
    num_output: 48
    bias_term: true
    group: 48
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_171"
  type: "Concat"
  bottom: "1278"
  bottom: "975"
  top: "978"
  concat_param {
    axis: 1
  }
}
layer {
  name: "Conv_172"
  type: "Convolution"
  bottom: "978"
  top: "1281"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Clip_173"
  type: "ReLU"
  bottom: "1281"
  top: "983"
}
layer {
  name: "Conv_174"
  type: "Convolution"
  bottom: "983"
  top: "1284"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_175"
  type: "ReLU"
  bottom: "1284"
  top: "988"
}
layer {
  name: "Add_176"
  type: "Eltwise"
  bottom: "988"
  bottom: "959"
  top: "989"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_177"
  type: "Convolution"
  bottom: "930"
  top: "1287"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_178"
  type: "ReLU"
  bottom: "1287"
  top: "994"
}
layer {
  name: "Conv_179"
  type: "Convolution"
  bottom: "994"
  top: "1290"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_180"
  type: "ReLU"
  bottom: "1290"
  top: "999"
}
layer {
  name: "Conv_181"
  type: "Convolution"
  bottom: "999"
  top: "1293"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_182"
  type: "ReLU"
  bottom: "1293"
  top: "1004"
}
layer {
  name: "Conv_183"
  type: "Convolution"
  bottom: "1004"
  top: "1296"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_184"
  type: "ReLU"
  bottom: "1296"
  top: "1009"
}
layer {
  name: "Conv_185"
  type: "Convolution"
  bottom: "1009"
  top: "output_0"
  convolution_param {
    num_output: 7
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Conv_186"
  type: "Convolution"
  bottom: "949"
  top: "1299"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_187"
  type: "ReLU"
  bottom: "1299"
  top: "1015"
}
layer {
  name: "Conv_188"
  type: "Convolution"
  bottom: "1015"
  top: "1302"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_189"
  type: "ReLU"
  bottom: "1302"
  top: "1020"
}
layer {
  name: "Conv_190"
  type: "Convolution"
  bottom: "1020"
  top: "1305"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_191"
  type: "ReLU"
  bottom: "1305"
  top: "1025"
}
layer {
  name: "Conv_192"
  type: "Convolution"
  bottom: "1025"
  top: "1308"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_193"
  type: "ReLU"
  bottom: "1308"
  top: "1030"
}
layer {
  name: "Conv_194"
  type: "Convolution"
  bottom: "1030"
  top: "output_1"
  convolution_param {
    num_output: 7
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Conv_195"
  type: "Convolution"
  bottom: "978"
  top: "1311"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_196"
  type: "ReLU"
  bottom: "1311"
  top: "1036"
}
layer {
  name: "Conv_197"
  type: "Convolution"
  bottom: "1036"
  top: "1314"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_198"
  type: "ReLU"
  bottom: "1314"
  top: "1041"
}
layer {
  name: "Conv_199"
  type: "Convolution"
  bottom: "1041"
  top: "1317"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_200"
  type: "ReLU"
  bottom: "1317"
  top: "1046"
}
layer {
  name: "Conv_201"
  type: "Convolution"
  bottom: "1046"
  top: "1320"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_202"
  type: "ReLU"
  bottom: "1320"
  top: "1051"
}
layer {
  name: "Conv_203"
  type: "Convolution"
  bottom: "1051"
  top: "output_2"
  convolution_param {
    num_output: 7
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Conv_204"
  type: "Convolution"
  bottom: "989"
  top: "1323"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_205"
  type: "ReLU"
  bottom: "1323"
  top: "1057"
}
layer {
  name: "Conv_206"
  type: "Convolution"
  bottom: "1057"
  top: "1326"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_207"
  type: "ReLU"
  bottom: "1326"
  top: "1062"
}
layer {
  name: "Conv_208"
  type: "Convolution"
  bottom: "1062"
  top: "1329"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_209"
  type: "ReLU"
  bottom: "1329"
  top: "1067"
}
layer {
  name: "Conv_210"
  type: "Convolution"
  bottom: "1067"
  top: "1332"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Clip_211"
  type: "ReLU"
  bottom: "1332"
  top: "1072"
}
layer {
  name: "Conv_212"
  type: "Convolution"
  bottom: "1072"
  top: "output_3"
  convolution_param {
    num_output: 7
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
